app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@example.com"], ["LIMIT", 1]]
---
  def token
    authenticate_with_http_basic do |email, password|
      user = User.find_by(email: email)